In [1]:
import pandas as pd
import numpy as np

C:\Users\user\AppData\Local\Temp\ipykernel_18132\2162656668.py:1: DeprecationWarning:
Pyarrow will become a required dependency of pandas in the next major release of pandas (pandas 3.0),
(to allow more performant data types, such as the Arrow string type, and better interoperability with other libraries)
but was not found to be installed on your system.
If this would cause problems for you,
please provide us feedback at https://github.com/pandas-dev/pandas/issues/54466

  import pandas as pd

In [2]:
dict1 = {
    'name': ['Ashish', 'Harry', 'Rohan', 'Subh'],
    'salary': [92, 34, 24, 17],
    'city': ['Rampur', 'Kolkata', 'Jaipur', 'Patna']
}

In [3]:
df = pd.DataFrame(dict1)

In [4]:
df

     name  salary     city
0  Ashish      92   Rampur
1   Harry      34  Kolkata
2   Rohan      24   Jaipur
3    Subh      17    Patna

In [5]:
df.to_csv('../../data_folder/s1/friendss1.csv')

In [6]:
df.to_csv('../../data_folder/s1/friendss1_without_index.csv', index=False)

In [7]:
df.head()

     name  salary     city
0  Ashish      92   Rampur
1   Harry      34  Kolkata
2   Rohan      24   Jaipur
3    Subh      17    Patna

In [8]:
df.head(2)

     name  salary     city
0  Ashish      92   Rampur
1   Harry      34  Kolkata

In [9]:
df.tail()

     name  salary     city
0  Ashish      92   Rampur
1   Harry      34  Kolkata
2   Rohan      24   Jaipur
3    Subh      17    Patna

In [10]:
df.tail(2)

    name  salary    city
2  Rohan      24  Jaipur
3   Subh      17   Patna

In [11]:
df.describe()

         salary
count   4.00000
mean   41.75000
std    34.21866
min    17.00000
25%    22.25000
50%    29.00000
75%    48.50000
max    92.00000

In [12]:
df = pd.read_csv('../../data_folder/ashish.csv')

In [13]:
df

   Train  Speed     City
0    123     12   Rampur
1    456     23  Kolkata
2    789     34   Jaipur
3     12     45    Patna

In [14]:
df['Speed']

0    12
1    23
2    34
3    45
Name: Speed, dtype: int64

In [15]:
df['Speed'][0]

12

In [16]:
df['Speed'][0] = 50

C:\Users\user\AppData\Local\Temp\ipykernel_18132\2609676089.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Speed'][0] = 50

In [17]:
df

   Train  Speed     City
0    123     50   Rampur
1    456     23  Kolkata
2    789     34   Jaipur
3     12     45    Patna

In [18]:
df.to_csv('../../data_folder/s1/updated_ashish.csv', index=False)

In [19]:
# code to change the index of an existing dataframe.
df.index = ['First', 'Second', 'Third', 'Fourth']

In [20]:
df

        Train  Speed     City
First     123     50   Rampur
Second    456     23  Kolkata
Third     789     34   Jaipur
Fourth     12     45    Patna

In [21]:
# code to generate a one dimensional df called series.
df = pd.Series(np.random.rand(34))

In [22]:
df

0     0.737207
1     0.356746
2     0.567652
3     0.115545
4     0.488197
5     0.123881
6     0.464736
7     0.135540
8     0.008746
9     0.142540
10    0.562293
11    0.855852
12    0.752282
13    0.979430
14    0.787410
15    0.569082
16    0.623652
17    0.094349
18    0.151665
19    0.782915
20    0.350166
21    0.551587
22    0.327220
23    0.231387
24    0.134971
25    0.630099
26    0.276102
27    0.950817
28    0.018344
29    0.992021
30    0.393808
31    0.127837
32    0.254246
33    0.539571
dtype: float64

In [23]:
type(df)

pandas.core.series.Series

In [24]:
new_df = pd.DataFrame(np.random.rand(334, 5), index=np.arange(334))

In [25]:
new_df

            0         1         2         3         4
0    0.142564  0.543507  0.028390  0.729458  0.897752
1    0.459636  0.367258  0.492757  0.426230  0.534793
2    0.968228  0.623801  0.091482  0.588905  0.027325
3    0.488781  0.310982  0.772037  0.740545  0.097667
4    0.779531  0.343359  0.883904  0.155237  0.282559
..        ...       ...       ...       ...       ...
329  0.885602  0.399155  0.315919  0.120213  0.654194
330  0.740516  0.812603  0.508483  0.258153  0.132610
331  0.500003  0.799575  0.392110  0.400364  0.148434
332  0.879523  0.161792  0.760152  0.671634  0.384554
333  0.294387  0.798372  0.177908  0.037558  0.020361

[334 rows x 5 columns]

In [26]:
new_df.head()

          0         1         2         3         4
0  0.142564  0.543507  0.028390  0.729458  0.897752
1  0.459636  0.367258  0.492757  0.426230  0.534793
2  0.968228  0.623801  0.091482  0.588905  0.027325
3  0.488781  0.310982  0.772037  0.740545  0.097667
4  0.779531  0.343359  0.883904  0.155237  0.282559

In [27]:
new_df.head(10)

          0         1         2         3         4
0  0.142564  0.543507  0.028390  0.729458  0.897752
1  0.459636  0.367258  0.492757  0.426230  0.534793
2  0.968228  0.623801  0.091482  0.588905  0.027325
3  0.488781  0.310982  0.772037  0.740545  0.097667
4  0.779531  0.343359  0.883904  0.155237  0.282559
5  0.080295  0.778916  0.221080  0.292180  0.506751
6  0.265739  0.815924  0.843049  0.404979  0.669283
7  0.120394  0.393274  0.766156  0.795445  0.158251
8  0.040467  0.640179  0.788577  0.682413  0.152309
9  0.587047  0.926546  0.026568  0.229929  0.813954

In [28]:
type(new_df)

pandas.core.frame.DataFrame

In [29]:
new_df.describe()

                0           1           2           3           4
count  334.000000  334.000000  334.000000  334.000000  334.000000
mean     0.514321    0.531916    0.493578    0.505254    0.457589
std      0.283035    0.292863    0.292063    0.274109    0.296596
min      0.002756    0.000962    0.000318    0.000234    0.000603
25%      0.276930    0.281662    0.239073    0.279013    0.191224
50%      0.507810    0.554945    0.485350    0.504053    0.429663
75%      0.758236    0.799274    0.759245    0.729169    0.703112
max      0.996621    0.997971    0.998433    0.995448    0.993003

In [30]:
new_df.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [31]:
new_df[0][0] = 'Ashish'

C:\Users\user\AppData\Local\Temp\ipykernel_18132\3256049214.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  new_df[0][0] = 'Ashish'
C:\Users\user\AppData\Local\Temp\ipykernel_18132\3256049214.py:1: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value 'Ashish' has dtype incompatible with float64, please explicitly cast to a compatible dtype first.
  new_df[0][0] = 'Ashish'

In [32]:
new_df

            0         1         2         3         4
0      Ashish  0.543507  0.028390  0.729458  0.897752
1    0.459636  0.367258  0.492757  0.426230  0.534793
2    0.968228  0.623801  0.091482  0.588905  0.027325
3    0.488781  0.310982  0.772037  0.740545  0.097667
4    0.779531  0.343359  0.883904  0.155237  0.282559
..        ...       ...       ...       ...       ...
329  0.885602  0.399155  0.315919  0.120213  0.654194
330  0.740516  0.812603  0.508483  0.258153  0.132610
331  0.500003  0.799575  0.392110  0.400364  0.148434
332  0.879523  0.161792  0.760152  0.671634  0.384554
333  0.294387  0.798372  0.177908  0.037558  0.020361

[334 rows x 5 columns]

In [33]:
new_df.dtypes

0     object
1    float64
2    float64
3    float64
4    float64
dtype: object

In [34]:
# Check the index.
new_df.index

Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
       ...
       324, 325, 326, 327, 328, 329, 330, 331, 332, 333],
      dtype='int32', length=334)

In [35]:
# check the columns
new_df.columns

RangeIndex(start=0, stop=5, step=1)

In [36]:
# code to convert a dataframe into numpy array
new_df.to_numpy()

array([['Ashish', 0.5435071630714369, 0.02839040966935169,
        0.729458426934753, 0.8977524336404055],
       [0.4596355104350486, 0.3672582278366189, 0.49275718304115745,
        0.4262302290933725, 0.5347928306566992],
       [0.9682280049093337, 0.6238009906903607, 0.09148158462403533,
        0.5889048910812473, 0.027325487231425916],
       ...,
       [0.5000028741321842, 0.7995750480438317, 0.3921097075843074,
        0.40036402271281224, 0.14843447974030877],
       [0.8795227001444292, 0.1617915262133397, 0.760151846827466,
        0.6716336870333816, 0.3845535034868922],
       [0.29438725389397924, 0.7983716244156408, 0.17790794933691512,
        0.03755831449898195, 0.020360570804013434]], dtype=object)

In [37]:
new_df[0][0] = 2.3

In [38]:
new_df

            0         1         2         3         4
0         2.3  0.543507  0.028390  0.729458  0.897752
1    0.459636  0.367258  0.492757  0.426230  0.534793
2    0.968228  0.623801  0.091482  0.588905  0.027325
3    0.488781  0.310982  0.772037  0.740545  0.097667
4    0.779531  0.343359  0.883904  0.155237  0.282559
..        ...       ...       ...       ...       ...
329  0.885602  0.399155  0.315919  0.120213  0.654194
330  0.740516  0.812603  0.508483  0.258153  0.132610
331  0.500003  0.799575  0.392110  0.400364  0.148434
332  0.879523  0.161792  0.760152  0.671634  0.384554
333  0.294387  0.798372  0.177908  0.037558  0.020361

[334 rows x 5 columns]

In [39]:
new_df.to_numpy()

array([[2.3, 0.5435071630714369, 0.02839040966935169, 0.729458426934753,
        0.8977524336404055],
       [0.4596355104350486, 0.3672582278366189, 0.49275718304115745,
        0.4262302290933725, 0.5347928306566992],
       [0.9682280049093337, 0.6238009906903607, 0.09148158462403533,
        0.5889048910812473, 0.027325487231425916],
       ...,
       [0.5000028741321842, 0.7995750480438317, 0.3921097075843074,
        0.40036402271281224, 0.14843447974030877],
       [0.8795227001444292, 0.1617915262133397, 0.760151846827466,
        0.6716336870333816, 0.3845535034868922],
       [0.29438725389397924, 0.7983716244156408, 0.17790794933691512,
        0.03755831449898195, 0.020360570804013434]], dtype=object)

In [40]:
# code to transpose a dataframe
new_df.T

,0,1,2,3,4,5,6,7,8,9,...,324,325,326,327,328,329,330,331,332,333
0,2.3,0.459636,0.968228,0.488781,0.779531,0.080295,0.265739,0.120394,0.040467,0.587047,...,0.571735,0.766163,0.718668,0.446286,0.676118,0.885602,0.740516,0.500003,0.879523,0.294387
1,0.543507,0.367258,0.623801,0.310982,0.343359,0.778916,0.815924,0.393274,0.640179,0.926546,...,0.383618,0.064407,0.527077,0.727266,0.6931,0.399155,0.812603,0.799575,0.161792,0.798372
2,0.02839,0.492757,0.091482,0.772037,0.883904,0.22108,0.843049,0.766156,0.788577,0.026568,...,0.59309,0.184289,0.066866,0.798302,0.70303,0.315919,0.508483,0.39211,0.760152,0.177908
3,0.729458,0.42623,0.588905,0.740545,0.155237,0.29218,0.404979,0.795445,0.682413,0.229929,...,0.938048,0.167416,0.608207,0.430397,0.319222,0.120213,0.258153,0.400364,0.671634,0.037558
4,0.897752,0.534793,0.027325,0.097667,0.282559,0.506751,0.669283,0.158251,0.152309,0.813954,...,0.061741,0.348542,0.347235,0.287215,0.792649,0.654194,0.13261,0.148434,0.384554,0.020361

In [41]:
new_df.head()

          0         1         2         3         4
0       2.3  0.543507  0.028390  0.729458  0.897752
1  0.459636  0.367258  0.492757  0.426230  0.534793
2  0.968228  0.623801  0.091482  0.588905  0.027325
3  0.488781  0.310982  0.772037  0.740545  0.097667
4  0.779531  0.343359  0.883904  0.155237  0.282559

In [42]:
# code to sort the dataframe as per index in the descending order.
new_df.sort_index(axis=0, ascending=False)

            0         1         2         3         4
333  0.294387  0.798372  0.177908  0.037558  0.020361
332  0.879523  0.161792  0.760152  0.671634  0.384554
331  0.500003  0.799575  0.392110  0.400364  0.148434
330  0.740516  0.812603  0.508483  0.258153  0.132610
329  0.885602  0.399155  0.315919  0.120213  0.654194
..        ...       ...       ...       ...       ...
4    0.779531  0.343359  0.883904  0.155237  0.282559
3    0.488781  0.310982  0.772037  0.740545  0.097667
2    0.968228  0.623801  0.091482  0.588905  0.027325
1    0.459636  0.367258  0.492757  0.426230  0.534793
0         2.3  0.543507  0.028390  0.729458  0.897752

[334 rows x 5 columns]

In [43]:
# code to sort the dataframe as per columns in descending order.
new_df.sort_index(axis=1, ascending=False)

            4         3         2         1         0
0    0.897752  0.729458  0.028390  0.543507       2.3
1    0.534793  0.426230  0.492757  0.367258  0.459636
2    0.027325  0.588905  0.091482  0.623801  0.968228
3    0.097667  0.740545  0.772037  0.310982  0.488781
4    0.282559  0.155237  0.883904  0.343359  0.779531
..        ...       ...       ...       ...       ...
329  0.654194  0.120213  0.315919  0.399155  0.885602
330  0.132610  0.258153  0.508483  0.812603  0.740516
331  0.148434  0.400364  0.392110  0.799575  0.500003
332  0.384554  0.671634  0.760152  0.161792  0.879523
333  0.020361  0.037558  0.177908  0.798372  0.294387

[334 rows x 5 columns]

In [44]:
new_df2 = new_df

In [45]:
new_df2[0][0] = 678

In [46]:
new_df

            0         1         2         3         4
0         678  0.543507  0.028390  0.729458  0.897752
1    0.459636  0.367258  0.492757  0.426230  0.534793
2    0.968228  0.623801  0.091482  0.588905  0.027325
3    0.488781  0.310982  0.772037  0.740545  0.097667
4    0.779531  0.343359  0.883904  0.155237  0.282559
..        ...       ...       ...       ...       ...
329  0.885602  0.399155  0.315919  0.120213  0.654194
330  0.740516  0.812603  0.508483  0.258153  0.132610
331  0.500003  0.799575  0.392110  0.400364  0.148434
332  0.879523  0.161792  0.760152  0.671634  0.384554
333  0.294387  0.798372  0.177908  0.037558  0.020361

[334 rows x 5 columns]

In [47]:
new_df2

            0         1         2         3         4
0         678  0.543507  0.028390  0.729458  0.897752
1    0.459636  0.367258  0.492757  0.426230  0.534793
2    0.968228  0.623801  0.091482  0.588905  0.027325
3    0.488781  0.310982  0.772037  0.740545  0.097667
4    0.779531  0.343359  0.883904  0.155237  0.282559
..        ...       ...       ...       ...       ...
329  0.885602  0.399155  0.315919  0.120213  0.654194
330  0.740516  0.812603  0.508483  0.258153  0.132610
331  0.500003  0.799575  0.392110  0.400364  0.148434
332  0.879523  0.161792  0.760152  0.671634  0.384554
333  0.294387  0.798372  0.177908  0.037558  0.020361

[334 rows x 5 columns]

In [48]:
new_df3 = new_df2.copy()

In [49]:
new_df3[0][0] = 'Ashish'

C:\Users\user\AppData\Local\Temp\ipykernel_18132\3695739475.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  new_df3[0][0] = 'Ashish'
C:\Users\user\AppData\Local\Temp\ipykernel_18132\3695739475.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  new_df3[0][0] = 'Ashish'

In [50]:
new_df3

            0         1         2         3         4
0      Ashish  0.543507  0.028390  0.729458  0.897752
1    0.459636  0.367258  0.492757  0.426230  0.534793
2    0.968228  0.623801  0.091482  0.588905  0.027325
3    0.488781  0.310982  0.772037  0.740545  0.097667
4    0.779531  0.343359  0.883904  0.155237  0.282559
..        ...       ...       ...       ...       ...
329  0.885602  0.399155  0.315919  0.120213  0.654194
330  0.740516  0.812603  0.508483  0.258153  0.132610
331  0.500003  0.799575  0.392110  0.400364  0.148434
332  0.879523  0.161792  0.760152  0.671634  0.384554
333  0.294387  0.798372  0.177908  0.037558  0.020361

[334 rows x 5 columns]

In [51]:
new_df2

            0         1         2         3         4
0         678  0.543507  0.028390  0.729458  0.897752
1    0.459636  0.367258  0.492757  0.426230  0.534793
2    0.968228  0.623801  0.091482  0.588905  0.027325
3    0.488781  0.310982  0.772037  0.740545  0.097667
4    0.779531  0.343359  0.883904  0.155237  0.282559
..        ...       ...       ...       ...       ...
329  0.885602  0.399155  0.315919  0.120213  0.654194
330  0.740516  0.812603  0.508483  0.258153  0.132610
331  0.500003  0.799575  0.392110  0.400364  0.148434
332  0.879523  0.161792  0.760152  0.671634  0.384554
333  0.294387  0.798372  0.177908  0.037558  0.020361

[334 rows x 5 columns]

In [52]:
new_df4 = new_df2[:]

In [53]:
new_df4[0][0] = 0.3456

C:\Users\user\AppData\Local\Temp\ipykernel_18132\1658468479.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  new_df4[0][0] = 0.3456
C:\Users\user\AppData\Local\Temp\ipykernel_18132\1658468479.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  new_df4[0][0] = 0.3456

In [54]:
new_df4

            0         1         2         3         4
0      0.3456  0.543507  0.028390  0.729458  0.897752
1    0.459636  0.367258  0.492757  0.426230  0.534793
2    0.968228  0.623801  0.091482  0.588905  0.027325
3    0.488781  0.310982  0.772037  0.740545  0.097667
4    0.779531  0.343359  0.883904  0.155237  0.282559
..        ...       ...       ...       ...       ...
329  0.885602  0.399155  0.315919  0.120213  0.654194
330  0.740516  0.812603  0.508483  0.258153  0.132610
331  0.500003  0.799575  0.392110  0.400364  0.148434
332  0.879523  0.161792  0.760152  0.671634  0.384554
333  0.294387  0.798372  0.177908  0.037558  0.020361

[334 rows x 5 columns]

In [55]:
new_df2

            0         1         2         3         4
0      0.3456  0.543507  0.028390  0.729458  0.897752
1    0.459636  0.367258  0.492757  0.426230  0.534793
2    0.968228  0.623801  0.091482  0.588905  0.027325
3    0.488781  0.310982  0.772037  0.740545  0.097667
4    0.779531  0.343359  0.883904  0.155237  0.282559
..        ...       ...       ...       ...       ...
329  0.885602  0.399155  0.315919  0.120213  0.654194
330  0.740516  0.812603  0.508483  0.258153  0.132610
331  0.500003  0.799575  0.392110  0.400364  0.148434
332  0.879523  0.161792  0.760152  0.671634  0.384554
333  0.294387  0.798372  0.177908  0.037558  0.020361

[334 rows x 5 columns]

In [56]:
new_df

            0         1         2         3         4
0      0.3456  0.543507  0.028390  0.729458  0.897752
1    0.459636  0.367258  0.492757  0.426230  0.534793
2    0.968228  0.623801  0.091482  0.588905  0.027325
3    0.488781  0.310982  0.772037  0.740545  0.097667
4    0.779531  0.343359  0.883904  0.155237  0.282559
..        ...       ...       ...       ...       ...
329  0.885602  0.399155  0.315919  0.120213  0.654194
330  0.740516  0.812603  0.508483  0.258153  0.132610
331  0.500003  0.799575  0.392110  0.400364  0.148434
332  0.879523  0.161792  0.760152  0.671634  0.384554
333  0.294387  0.798372  0.177908  0.037558  0.020361

[334 rows x 5 columns]

In [57]:
new_df.loc[0, 0] = 890

In [58]:
new_df

            0         1         2         3         4
0         890  0.543507  0.028390  0.729458  0.897752
1    0.459636  0.367258  0.492757  0.426230  0.534793
2    0.968228  0.623801  0.091482  0.588905  0.027325
3    0.488781  0.310982  0.772037  0.740545  0.097667
4    0.779531  0.343359  0.883904  0.155237  0.282559
..        ...       ...       ...       ...       ...
329  0.885602  0.399155  0.315919  0.120213  0.654194
330  0.740516  0.812603  0.508483  0.258153  0.132610
331  0.500003  0.799575  0.392110  0.400364  0.148434
332  0.879523  0.161792  0.760152  0.671634  0.384554
333  0.294387  0.798372  0.177908  0.037558  0.020361

[334 rows x 5 columns]

In [59]:
# code to change the column name
new_df.columns = list('abcde')

In [60]:
new_df

            a         b         c         d         e
0         890  0.543507  0.028390  0.729458  0.897752
1    0.459636  0.367258  0.492757  0.426230  0.534793
2    0.968228  0.623801  0.091482  0.588905  0.027325
3    0.488781  0.310982  0.772037  0.740545  0.097667
4    0.779531  0.343359  0.883904  0.155237  0.282559
..        ...       ...       ...       ...       ...
329  0.885602  0.399155  0.315919  0.120213  0.654194
330  0.740516  0.812603  0.508483  0.258153  0.132610
331  0.500003  0.799575  0.392110  0.400364  0.148434
332  0.879523  0.161792  0.760152  0.671634  0.384554
333  0.294387  0.798372  0.177908  0.037558  0.020361

[334 rows x 5 columns]

In [61]:
new_df.index = np.arange(334)

In [62]:
new_df

            a         b         c         d         e
0         890  0.543507  0.028390  0.729458  0.897752
1    0.459636  0.367258  0.492757  0.426230  0.534793
2    0.968228  0.623801  0.091482  0.588905  0.027325
3    0.488781  0.310982  0.772037  0.740545  0.097667
4    0.779531  0.343359  0.883904  0.155237  0.282559
..        ...       ...       ...       ...       ...
329  0.885602  0.399155  0.315919  0.120213  0.654194
330  0.740516  0.812603  0.508483  0.258153  0.132610
331  0.500003  0.799575  0.392110  0.400364  0.148434
332  0.879523  0.161792  0.760152  0.671634  0.384554
333  0.294387  0.798372  0.177908  0.037558  0.020361

[334 rows x 5 columns]

In [63]:
new_df.columns = ['A', 'B', 'C', 'D', 'E']

In [64]:
new_df

            A         B         C         D         E
0         890  0.543507  0.028390  0.729458  0.897752
1    0.459636  0.367258  0.492757  0.426230  0.534793
2    0.968228  0.623801  0.091482  0.588905  0.027325
3    0.488781  0.310982  0.772037  0.740545  0.097667
4    0.779531  0.343359  0.883904  0.155237  0.282559
..        ...       ...       ...       ...       ...
329  0.885602  0.399155  0.315919  0.120213  0.654194
330  0.740516  0.812603  0.508483  0.258153  0.132610
331  0.500003  0.799575  0.392110  0.400364  0.148434
332  0.879523  0.161792  0.760152  0.671634  0.384554
333  0.294387  0.798372  0.177908  0.037558  0.020361

[334 rows x 5 columns]

In [65]:
new_df.loc[0, 'A'] = 'Ashish Kumar'

In [66]:
new_df

                A         B         C         D         E
0    Ashish Kumar  0.543507  0.028390  0.729458  0.897752
1        0.459636  0.367258  0.492757  0.426230  0.534793
2        0.968228  0.623801  0.091482  0.588905  0.027325
3        0.488781  0.310982  0.772037  0.740545  0.097667
4        0.779531  0.343359  0.883904  0.155237  0.282559
..            ...       ...       ...       ...       ...
329      0.885602  0.399155  0.315919  0.120213  0.654194
330      0.740516  0.812603  0.508483  0.258153  0.132610
331      0.500003  0.799575  0.392110  0.400364  0.148434
332      0.879523  0.161792  0.760152  0.671634  0.384554
333      0.294387  0.798372  0.177908  0.037558  0.020361

[334 rows x 5 columns]

In [67]:
new_df.loc[0, 0] = 567

In [68]:
new_df

                A         B         C         D         E      0
0    Ashish Kumar  0.543507  0.028390  0.729458  0.897752  567.0
1        0.459636  0.367258  0.492757  0.426230  0.534793    NaN
2        0.968228  0.623801  0.091482  0.588905  0.027325    NaN
3        0.488781  0.310982  0.772037  0.740545  0.097667    NaN
4        0.779531  0.343359  0.883904  0.155237  0.282559    NaN
..            ...       ...       ...       ...       ...    ...
329      0.885602  0.399155  0.315919  0.120213  0.654194    NaN
330      0.740516  0.812603  0.508483  0.258153  0.132610    NaN
331      0.500003  0.799575  0.392110  0.400364  0.148434    NaN
332      0.879523  0.161792  0.760152  0.671634  0.384554    NaN
333      0.294387  0.798372  0.177908  0.037558  0.020361    NaN

[334 rows x 6 columns]

In [69]:
# code to drop a column in the dataframe.
new_df.drop(0, axis=1)

                A         B         C         D         E
0    Ashish Kumar  0.543507  0.028390  0.729458  0.897752
1        0.459636  0.367258  0.492757  0.426230  0.534793
2        0.968228  0.623801  0.091482  0.588905  0.027325
3        0.488781  0.310982  0.772037  0.740545  0.097667
4        0.779531  0.343359  0.883904  0.155237  0.282559
..            ...       ...       ...       ...       ...
329      0.885602  0.399155  0.315919  0.120213  0.654194
330      0.740516  0.812603  0.508483  0.258153  0.132610
331      0.500003  0.799575  0.392110  0.400364  0.148434
332      0.879523  0.161792  0.760152  0.671634  0.384554
333      0.294387  0.798372  0.177908  0.037558  0.020361

[334 rows x 5 columns]

In [70]:
new_df

                A         B         C         D         E      0
0    Ashish Kumar  0.543507  0.028390  0.729458  0.897752  567.0
1        0.459636  0.367258  0.492757  0.426230  0.534793    NaN
2        0.968228  0.623801  0.091482  0.588905  0.027325    NaN
3        0.488781  0.310982  0.772037  0.740545  0.097667    NaN
4        0.779531  0.343359  0.883904  0.155237  0.282559    NaN
..            ...       ...       ...       ...       ...    ...
329      0.885602  0.399155  0.315919  0.120213  0.654194    NaN
330      0.740516  0.812603  0.508483  0.258153  0.132610    NaN
331      0.500003  0.799575  0.392110  0.400364  0.148434    NaN
332      0.879523  0.161792  0.760152  0.671634  0.384554    NaN
333      0.294387  0.798372  0.177908  0.037558  0.020361    NaN

[334 rows x 6 columns]

In [71]:
new_df.loc[0, 0] = 768

In [72]:
new_df

                A         B         C         D         E      0
0    Ashish Kumar  0.543507  0.028390  0.729458  0.897752  768.0
1        0.459636  0.367258  0.492757  0.426230  0.534793    NaN
2        0.968228  0.623801  0.091482  0.588905  0.027325    NaN
3        0.488781  0.310982  0.772037  0.740545  0.097667    NaN
4        0.779531  0.343359  0.883904  0.155237  0.282559    NaN
..            ...       ...       ...       ...       ...    ...
329      0.885602  0.399155  0.315919  0.120213  0.654194    NaN
330      0.740516  0.812603  0.508483  0.258153  0.132610    NaN
331      0.500003  0.799575  0.392110  0.400364  0.148434    NaN
332      0.879523  0.161792  0.760152  0.671634  0.384554    NaN
333      0.294387  0.798372  0.177908  0.037558  0.020361    NaN

[334 rows x 6 columns]

In [73]:
# Code to drop zero rows from a dataframe
new_df.drop(0)

            A         B         C         D         E   0
1    0.459636  0.367258  0.492757  0.426230  0.534793 NaN
2    0.968228  0.623801  0.091482  0.588905  0.027325 NaN
3    0.488781  0.310982  0.772037  0.740545  0.097667 NaN
4    0.779531  0.343359  0.883904  0.155237  0.282559 NaN
5    0.080295  0.778916  0.221080  0.292180  0.506751 NaN
..        ...       ...       ...       ...       ...  ..
329  0.885602  0.399155  0.315919  0.120213  0.654194 NaN
330  0.740516  0.812603  0.508483  0.258153  0.132610 NaN
331  0.500003  0.799575  0.392110  0.400364  0.148434 NaN
332  0.879523  0.161792  0.760152  0.671634  0.384554 NaN
333  0.294387  0.798372  0.177908  0.037558  0.020361 NaN

[333 rows x 6 columns]

In [74]:
new_df

                A         B         C         D         E      0
0    Ashish Kumar  0.543507  0.028390  0.729458  0.897752  768.0
1        0.459636  0.367258  0.492757  0.426230  0.534793    NaN
2        0.968228  0.623801  0.091482  0.588905  0.027325    NaN
3        0.488781  0.310982  0.772037  0.740545  0.097667    NaN
4        0.779531  0.343359  0.883904  0.155237  0.282559    NaN
..            ...       ...       ...       ...       ...    ...
329      0.885602  0.399155  0.315919  0.120213  0.654194    NaN
330      0.740516  0.812603  0.508483  0.258153  0.132610    NaN
331      0.500003  0.799575  0.392110  0.400364  0.148434    NaN
332      0.879523  0.161792  0.760152  0.671634  0.384554    NaN
333      0.294387  0.798372  0.177908  0.037558  0.020361    NaN

[334 rows x 6 columns]

In [75]:
# code to drop zero column from dataframe
new_df.drop(0, axis=1)

                A         B         C         D         E
0    Ashish Kumar  0.543507  0.028390  0.729458  0.897752
1        0.459636  0.367258  0.492757  0.426230  0.534793
2        0.968228  0.623801  0.091482  0.588905  0.027325
3        0.488781  0.310982  0.772037  0.740545  0.097667
4        0.779531  0.343359  0.883904  0.155237  0.282559
..            ...       ...       ...       ...       ...
329      0.885602  0.399155  0.315919  0.120213  0.654194
330      0.740516  0.812603  0.508483  0.258153  0.132610
331      0.500003  0.799575  0.392110  0.400364  0.148434
332      0.879523  0.161792  0.760152  0.671634  0.384554
333      0.294387  0.798372  0.177908  0.037558  0.020361

[334 rows x 5 columns]

In [76]:
new_df.head()

              A         B         C         D         E      0
0  Ashish Kumar  0.543507  0.028390  0.729458  0.897752  768.0
1      0.459636  0.367258  0.492757  0.426230  0.534793    NaN
2      0.968228  0.623801  0.091482  0.588905  0.027325    NaN
3      0.488781  0.310982  0.772037  0.740545  0.097667    NaN
4      0.779531  0.343359  0.883904  0.155237  0.282559    NaN

In [77]:
# code to affect the changes in the dataframe also.
new_df = new_df.drop(0, axis=1)

In [78]:
new_df

                A         B         C         D         E
0    Ashish Kumar  0.543507  0.028390  0.729458  0.897752
1        0.459636  0.367258  0.492757  0.426230  0.534793
2        0.968228  0.623801  0.091482  0.588905  0.027325
3        0.488781  0.310982  0.772037  0.740545  0.097667
4        0.779531  0.343359  0.883904  0.155237  0.282559
..            ...       ...       ...       ...       ...
329      0.885602  0.399155  0.315919  0.120213  0.654194
330      0.740516  0.812603  0.508483  0.258153  0.132610
331      0.500003  0.799575  0.392110  0.400364  0.148434
332      0.879523  0.161792  0.760152  0.671634  0.384554
333      0.294387  0.798372  0.177908  0.037558  0.020361

[334 rows x 5 columns]

In [79]:
new_df.head()

              A         B         C         D         E
0  Ashish Kumar  0.543507  0.028390  0.729458  0.897752
1      0.459636  0.367258  0.492757  0.426230  0.534793
2      0.968228  0.623801  0.091482  0.588905  0.027325
3      0.488781  0.310982  0.772037  0.740545  0.097667
4      0.779531  0.343359  0.883904  0.155237  0.282559

In [80]:
# code to get some specific row and column.
new_df.loc[1, 'A']

0.4596355104350486

In [81]:
# code to get 1 and 2 rows and C column from a dataframe.
new_df.loc[[1,2], 'C']

1    0.492757
2    0.091482
Name: C, dtype: float64

In [82]:
new_df.loc[[1, 2], ['C', 'D']]

          C         D
1  0.492757  0.426230
2  0.091482  0.588905

In [83]:
# code to get all the rows from the dataframe and column C and D
new_df.loc[:, ['C', 'D']]

            C         D
0    0.028390  0.729458
1    0.492757  0.426230
2    0.091482  0.588905
3    0.772037  0.740545
4    0.883904  0.155237
..        ...       ...
329  0.315919  0.120213
330  0.508483  0.258153
331  0.392110  0.400364
332  0.760152  0.671634
333  0.177908  0.037558

[334 rows x 2 columns]

In [84]:
# code to get 1 and 2 rows with all the columns.
new_df.loc[[1, 2], :]

          A         B         C         D         E
1  0.459636  0.367258  0.492757  0.426230  0.534793
2  0.968228  0.623801  0.091482  0.588905  0.027325

In [85]:
new_df.loc[0, 0] = 0.23

In [86]:
new_df

                A         B         C         D         E     0
0    Ashish Kumar  0.543507  0.028390  0.729458  0.897752  0.23
1        0.459636  0.367258  0.492757  0.426230  0.534793   NaN
2        0.968228  0.623801  0.091482  0.588905  0.027325   NaN
3        0.488781  0.310982  0.772037  0.740545  0.097667   NaN
4        0.779531  0.343359  0.883904  0.155237  0.282559   NaN
..            ...       ...       ...       ...       ...   ...
329      0.885602  0.399155  0.315919  0.120213  0.654194   NaN
330      0.740516  0.812603  0.508483  0.258153  0.132610   NaN
331      0.500003  0.799575  0.392110  0.400364  0.148434   NaN
332      0.879523  0.161792  0.760152  0.671634  0.384554   NaN
333      0.294387  0.798372  0.177908  0.037558  0.020361   NaN

[334 rows x 6 columns]

In [87]:
new_df = new_df.drop(0, axis=1)

In [88]:
new_df

                A         B         C         D         E
0    Ashish Kumar  0.543507  0.028390  0.729458  0.897752
1        0.459636  0.367258  0.492757  0.426230  0.534793
2        0.968228  0.623801  0.091482  0.588905  0.027325
3        0.488781  0.310982  0.772037  0.740545  0.097667
4        0.779531  0.343359  0.883904  0.155237  0.282559
..            ...       ...       ...       ...       ...
329      0.885602  0.399155  0.315919  0.120213  0.654194
330      0.740516  0.812603  0.508483  0.258153  0.132610
331      0.500003  0.799575  0.392110  0.400364  0.148434
332      0.879523  0.161792  0.760152  0.671634  0.384554
333      0.294387  0.798372  0.177908  0.037558  0.020361

[334 rows x 5 columns]

In [89]:
new_df.loc[0, 'A'] = 0.34

In [90]:
new_df

            A         B         C         D         E
0        0.34  0.543507  0.028390  0.729458  0.897752
1    0.459636  0.367258  0.492757  0.426230  0.534793
2    0.968228  0.623801  0.091482  0.588905  0.027325
3    0.488781  0.310982  0.772037  0.740545  0.097667
4    0.779531  0.343359  0.883904  0.155237  0.282559
..        ...       ...       ...       ...       ...
329  0.885602  0.399155  0.315919  0.120213  0.654194
330  0.740516  0.812603  0.508483  0.258153  0.132610
331  0.500003  0.799575  0.392110  0.400364  0.148434
332  0.879523  0.161792  0.760152  0.671634  0.384554
333  0.294387  0.798372  0.177908  0.037558  0.020361

[334 rows x 5 columns]

In [91]:
new_df.loc[1]

A    0.459636
B    0.367258
C    0.492757
D     0.42623
E    0.534793
Name: 1, dtype: object

In [92]:
# code to get the rows whose column A value is less than 0.3
new_df.loc[new_df['A'] < 0.3, :]

            A         B         C         D         E
5    0.080295  0.778916  0.221080  0.292180  0.506751
6    0.265739  0.815924  0.843049  0.404979  0.669283
7    0.120394  0.393274  0.766156  0.795445  0.158251
8    0.040467  0.640179  0.788577  0.682413  0.152309
10   0.281361  0.026864  0.824736  0.586246  0.645231
..        ...       ...       ...       ...       ...
307  0.280569  0.598347  0.831334  0.483590  0.701899
314  0.075542  0.238739  0.262228  0.702321  0.962177
316   0.06324  0.198408  0.499204  0.290606  0.184311
321   0.24075  0.997971  0.416895  0.621752  0.725063
333  0.294387  0.798372  0.177908  0.037558  0.020361

[94 rows x 5 columns]

In [94]:
# code to get all the rows where column A value is less than 0.3 and C is greater than 0.1
new_df.loc[(new_df['A'] < 0.3) & (new_df['C'] > 0.1)]

            A         B         C         D         E
5    0.080295  0.778916  0.221080  0.292180  0.506751
6    0.265739  0.815924  0.843049  0.404979  0.669283
7    0.120394  0.393274  0.766156  0.795445  0.158251
8    0.040467  0.640179  0.788577  0.682413  0.152309
10   0.281361  0.026864  0.824736  0.586246  0.645231
..        ...       ...       ...       ...       ...
307  0.280569  0.598347  0.831334  0.483590  0.701899
314  0.075542  0.238739  0.262228  0.702321  0.962177
316   0.06324  0.198408  0.499204  0.290606  0.184311
321   0.24075  0.997971  0.416895  0.621752  0.725063
333  0.294387  0.798372  0.177908  0.037558  0.020361

[84 rows x 5 columns]

In [96]:
new_df.head(2)

          A         B         C         D         E
0      0.34  0.543507  0.028390  0.729458  0.897752
1  0.459636  0.367258  0.492757  0.426230  0.534793

In [97]:
new_df.iloc[0, 4]

0.8977524336404055

In [98]:
new_df.iloc[[0,2], [1,2]]

          B         C
0  0.543507  0.028390
2  0.623801  0.091482

In [99]:
new_df.drop(0)

            A         B         C         D         E
1    0.459636  0.367258  0.492757  0.426230  0.534793
2    0.968228  0.623801  0.091482  0.588905  0.027325
3    0.488781  0.310982  0.772037  0.740545  0.097667
4    0.779531  0.343359  0.883904  0.155237  0.282559
5    0.080295  0.778916  0.221080  0.292180  0.506751
..        ...       ...       ...       ...       ...
329  0.885602  0.399155  0.315919  0.120213  0.654194
330  0.740516  0.812603  0.508483  0.258153  0.132610
331  0.500003  0.799575  0.392110  0.400364  0.148434
332  0.879523  0.161792  0.760152  0.671634  0.384554
333  0.294387  0.798372  0.177908  0.037558  0.020361

[333 rows x 5 columns]

In [100]:
new_df.drop(['A', 'C'], axis=1)

            B         D         E
0    0.543507  0.729458  0.897752
1    0.367258  0.426230  0.534793
2    0.623801  0.588905  0.027325
3    0.310982  0.740545  0.097667
4    0.343359  0.155237  0.282559
..        ...       ...       ...
329  0.399155  0.120213  0.654194
330  0.812603  0.258153  0.132610
331  0.799575  0.400364  0.148434
332  0.161792  0.671634  0.384554
333  0.798372  0.037558  0.020361

[334 rows x 3 columns]

In [102]:
# code to apply the changes on the the data frame.
new_df.drop(['A', 'C'], axis=1, inplace=True)

In [103]:
new_df

            B         D         E
0    0.543507  0.729458  0.897752
1    0.367258  0.426230  0.534793
2    0.623801  0.588905  0.027325
3    0.310982  0.740545  0.097667
4    0.343359  0.155237  0.282559
..        ...       ...       ...
329  0.399155  0.120213  0.654194
330  0.812603  0.258153  0.132610
331  0.799575  0.400364  0.148434
332  0.161792  0.671634  0.384554
333  0.798372  0.037558  0.020361

[334 rows x 3 columns]

In [104]:
new_df.drop([1, 5], axis=0, inplace=True)

In [105]:
new_df

            B         D         E
0    0.543507  0.729458  0.897752
2    0.623801  0.588905  0.027325
3    0.310982  0.740545  0.097667
4    0.343359  0.155237  0.282559
6    0.815924  0.404979  0.669283
..        ...       ...       ...
329  0.399155  0.120213  0.654194
330  0.812603  0.258153  0.132610
331  0.799575  0.400364  0.148434
332  0.161792  0.671634  0.384554
333  0.798372  0.037558  0.020361

[332 rows x 3 columns]

In [107]:
# code to reset the index of a data frame.
# It will reset the index but it will add new column also index column.
new_df.reset_index()

     index         B         D         E
0        0  0.543507  0.729458  0.897752
1        2  0.623801  0.588905  0.027325
2        3  0.310982  0.740545  0.097667
3        4  0.343359  0.155237  0.282559
4        6  0.815924  0.404979  0.669283
..     ...       ...       ...       ...
327    329  0.399155  0.120213  0.654194
328    330  0.812603  0.258153  0.132610
329    331  0.799575  0.400364  0.148434
330    332  0.161792  0.671634  0.384554
331    333  0.798372  0.037558  0.020361

[332 rows x 4 columns]

In [109]:
# code to reset the index without adding any column to it.
new_df.reset_index(drop=True)

            B         D         E
0    0.543507  0.729458  0.897752
1    0.623801  0.588905  0.027325
2    0.310982  0.740545  0.097667
3    0.343359  0.155237  0.282559
4    0.815924  0.404979  0.669283
..        ...       ...       ...
327  0.399155  0.120213  0.654194
328  0.812603  0.258153  0.132610
329  0.799575  0.400364  0.148434
330  0.161792  0.671634  0.384554
331  0.798372  0.037558  0.020361

[332 rows x 3 columns]

In [110]:
# code to reset the index without adding any column and applying the change also.
new_df.reset_index(drop=True, inplace=True)

In [111]:
new_df

            B         D         E
0    0.543507  0.729458  0.897752
1    0.623801  0.588905  0.027325
2    0.310982  0.740545  0.097667
3    0.343359  0.155237  0.282559
4    0.815924  0.404979  0.669283
..        ...       ...       ...
327  0.399155  0.120213  0.654194
328  0.812603  0.258153  0.132610
329  0.799575  0.400364  0.148434
330  0.161792  0.671634  0.384554
331  0.798372  0.037558  0.020361

[332 rows x 3 columns]

In [112]:
#code to check if the value is null or not.
new_df['B'].isnull()

0      False
1      False
2      False
3      False
4      False
       ...
327    False
328    False
329    False
330    False
331    False
Name: B, Length: 332, dtype: bool

In [113]:
new_df.isnull()

         B      D      E
0    False  False  False
1    False  False  False
2    False  False  False
3    False  False  False
4    False  False  False
..     ...    ...    ...
327  False  False  False
328  False  False  False
329  False  False  False
330  False  False  False
331  False  False  False

[332 rows x 3 columns]

In [114]:
# code to assign None value to b column
new_df.loc['B'] = None

In [115]:
new_df

            B         D         E
0    0.543507  0.729458  0.897752
1    0.623801  0.588905  0.027325
2    0.310982  0.740545  0.097667
3    0.343359  0.155237  0.282559
4    0.815924  0.404979  0.669283
..        ...       ...       ...
328  0.812603  0.258153  0.132610
329  0.799575  0.400364  0.148434
330  0.161792  0.671634  0.384554
331  0.798372  0.037558  0.020361
B         NaN       NaN       NaN

[333 rows x 3 columns]

In [116]:
new_df.drop('B', axis=0, inplace=True)

In [117]:
new_df

            B         D         E
0    0.543507  0.729458  0.897752
1    0.623801  0.588905  0.027325
2    0.310982  0.740545  0.097667
3    0.343359  0.155237  0.282559
4    0.815924  0.404979  0.669283
..        ...       ...       ...
327  0.399155  0.120213  0.654194
328  0.812603  0.258153  0.132610
329  0.799575  0.400364  0.148434
330  0.161792  0.671634  0.384554
331  0.798372  0.037558  0.020361

[332 rows x 3 columns]

In [119]:
# code to assign None value to the B column in all the rows.
new_df.loc[range(332),'B'] = None

In [120]:
new_df

        B         D         E
0    None  0.729458  0.897752
1    None  0.588905  0.027325
2    None  0.740545  0.097667
3    None  0.155237  0.282559
4    None  0.404979  0.669283
..    ...       ...       ...
327  None  0.120213  0.654194
328  None  0.258153  0.132610
329  None  0.400364  0.148434
330  None  0.671634  0.384554
331  None  0.037558  0.020361

[332 rows x 3 columns]

In [122]:
# Same thing as above with another approach.
new_df['B'] = None

In [123]:
new_df.isnull()

        B      D      E
0    True  False  False
1    True  False  False
2    True  False  False
3    True  False  False
4    True  False  False
..    ...    ...    ...
327  True  False  False
328  True  False  False
329  True  False  False
330  True  False  False
331  True  False  False

[332 rows x 3 columns]

In [125]:
# same thing as above.
new_df.loc[:, 'B'] = None

In [126]:
new_df.isnull()

        B      D      E
0    True  False  False
1    True  False  False
2    True  False  False
3    True  False  False
4    True  False  False
..    ...    ...    ...
327  True  False  False
328  True  False  False
329  True  False  False
330  True  False  False
331  True  False  False

[332 rows x 3 columns]

In [127]:
new_df.iloc[:, 0] = 34

In [128]:
new_df

      B         D         E
0    34  0.729458  0.897752
1    34  0.588905  0.027325
2    34  0.740545  0.097667
3    34  0.155237  0.282559
4    34  0.404979  0.669283
..   ..       ...       ...
327  34  0.120213  0.654194
328  34  0.258153  0.132610
329  34  0.400364  0.148434
330  34  0.671634  0.384554
331  34  0.037558  0.020361

[332 rows x 3 columns]

In [129]:
a_dict = {
    "name": ['Ashish', 'kumar', 'sah'],
    "toy": [np.nan, 'BatMobile', 'BullWhip'],
    "born": [pd.NaT, pd.Timestamp('1940-04-05'), pd.NaT]
}

In [130]:
a_dict

{'name': ['Ashish', 'kumar', 'sah'],
 'toy': [nan, 'BatMobile', 'BullWhip'],
 'born': [NaT, Timestamp('1940-04-05 00:00:00'), NaT]}

In [131]:
df = pd.DataFrame(a_dict)

In [132]:
df

     name        toy       born
0  Ashish        NaN        NaT
1   kumar  BatMobile 1940-04-05
2     sah   BullWhip        NaT

In [133]:
# code to create a dataframe from a list of tuples.
a_list = [
    ('Ashish', 23, '20-12-2023'),
    ('Kumar', 25, '21-12-2023'),
    ('Sah', 21, '22-12-2023'),
]

In [134]:
df1 = pd.DataFrame(a_list, columns=['Name', 'Age', 'DOB'])

In [135]:
df1

     Name  Age         DOB
0  Ashish   23  20-12-2023
1   Kumar   25  21-12-2023
2     Sah   21  22-12-2023

In [136]:
df

     name        toy       born
0  Ashish        NaN        NaT
1   kumar  BatMobile 1940-04-05
2     sah   BullWhip        NaT

In [139]:
# code to drop those rows having null value.
df.dropna()

    name        toy       born
1  kumar  BatMobile 1940-04-05

In [138]:
df

     name        toy       born
0  Ashish        NaN        NaT
1   kumar  BatMobile 1940-04-05
2     sah   BullWhip        NaT

In [140]:
# code to drop the rows if and only if all the column value of any rows are null.
df.dropna(how='all')

     name        toy       born
0  Ashish        NaN        NaT
1   kumar  BatMobile 1940-04-05
2     sah   BullWhip        NaT

In [141]:
b_dict = {'name': ['Ashish', 'Kumar', 'Sah'],
         'toy': [np.nan, np.nan, np.nan],
         'dob': [pd.NaT, pd.Timestamp('1940-04-25'), pd.NaT]}

In [142]:
df1 = pd.DataFrame(b_dict)

In [143]:
df1

     name  toy        dob
0  Ashish  NaN        NaT
1   Kumar  NaN 1940-04-25
2     Sah  NaN        NaT

In [144]:
df1.dropna(axis=1, how='all')

     name        dob
0  Ashish        NaT
1   Kumar 1940-04-25
2     Sah        NaT

In [145]:
df12 = pd.DataFrame({"name": ['Ashish', 'Kumar', 'Ashish'],
                    "toy": [np.nan, np.nan, np.nan],
                    "born": [pd.NaT, pd.Timestamp('1940-04-25'), pd.NaT]})

In [146]:
df12

     name  toy       born
0  Ashish  NaN        NaT
1   Kumar  NaN 1940-04-25
2  Ashish  NaN        NaT

In [148]:
# code to drop duplicate rows by default keep first row
df12.drop_duplicates(subset=['name'])

     name  toy       born
0  Ashish  NaN        NaT
1   Kumar  NaN 1940-04-25

In [149]:
df12

     name  toy       born
0  Ashish  NaN        NaT
1   Kumar  NaN 1940-04-25
2  Ashish  NaN        NaT

In [153]:
df12.drop_duplicates(subset=['name'], keep='first')

     name  toy       born
0  Ashish  NaN        NaT
1   Kumar  NaN 1940-04-25

In [154]:
#code to remove duplicate and keep the last.
df12.drop_duplicates(subset=['name'], keep='last')

     name  toy       born
1   Kumar  NaN 1940-04-25
2  Ashish  NaN        NaT

In [155]:
# code ti drop every row do not keep any thing.
df12.drop_duplicates(subset=['name'], keep=False)

    name  toy       born
1  Kumar  NaN 1940-04-25

In [157]:
# code to return the dimension of a dataframe.
df12.shape

(3, 3)

In [158]:
# code to return the information about the dataframe
df12.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    3 non-null      object
 1   toy     0 non-null      float64
 2   born    1 non-null      datetime64[ns]
dtypes: datetime64[ns](1), float64(1), object(1)
memory usage: 200.0+ bytes

In [159]:
# code to count the unique value of a column of a dataframe 
df12['name'].value_counts()

name
Ashish    2
Kumar     1
Name: count, dtype: int64

In [160]:
# code ti count the unique value of a ci=olumn of a dataframe after avoiding na value
df12['name'].value_counts(dropna=True)

name
Ashish    2
Kumar     1
Name: count, dtype: int64

In [161]:
df

     name        toy       born
0  Ashish        NaN        NaT
1   kumar  BatMobile 1940-04-05
2     sah   BullWhip        NaT

In [163]:
df12['name'].value_counts(dropna=True)

name
Ashish    2
Kumar     1
Name: count, dtype: int64

In [164]:
df12.isnull()

    name   toy   born
0  False  True   True
1  False  True  False
2  False  True   True

In [165]:
df12.notnull()

   name    toy   born
0  True  False  False
1  True  False   True
2  True  False  False

In [166]:
a_dict = {
    'roll_name': [1, 2, 3],
    'result': [88, 89, 90]
}

In [168]:
df = pd.DataFrame(a_dict)

In [169]:
df

   roll_name  result
0          1      88
1          2      89
2          3      90

In [170]:
df.describe()

       roll_name  result
count        3.0     3.0
mean         2.0    89.0
std          1.0     1.0
min          1.0    88.0
25%          1.5    88.5
50%          2.0    89.0
75%          2.5    89.5
max          3.0    90.0

In [171]:
df.mean()

roll_name     2.0
result       89.0
dtype: float64

In [172]:
df.corr()

           roll_name  result
roll_name        1.0     1.0
result           1.0     1.0

In [173]:
df.count()

roll_name    3
result       3
dtype: int64

In [174]:
df.max()

roll_name     3
result       90
dtype: int64

In [175]:
df.min()

roll_name     1
result       88
dtype: int64

In [176]:
df['roll_name'].min()

1

In [177]:
df.median()

roll_name     2.0
result       89.0
dtype: float64

In [178]:
df.std()

roll_name    1.0
result       1.0
dtype: float64

In [179]:
# code to read data from excelsheet.
# first we need to install xlrd
# pip install xlrd

# data = pd.read_excel('data.xlsx')
# code to write data in excel
# pd.to_excel('data.xlsx', sheet_name='sheet2')

In [180]:
# write a 3 by 3 dataframe and add one column at last and store the value of 20 percent of previous column.
# if value of previous column is greater than 35.

person_dict = {
    'name': ['Ashish', 'Mohan', 'Lokesh'],
    'Age': [28, 23, 24],
    'Salary': [100, 200, 300]
}

In [185]:
df = pd.DataFrame(person_dict)

In [186]:
df

     name  Age  Salary
0  Ashish   28     100
1   Mohan   23     200
2  Lokesh   24     300

In [183]:
df['result'] = df['Salary'].apply(lambda x: x*0.2 if x < 200 else None)

In [184]:
df

     name  Age  Salary  result
0  Ashish   28     100    20.0
1   Mohan   23     200     NaN
2  Lokesh   24     300     NaN

In [187]:
df['result'] = df['Salary']

In [188]:
df

     name  Age  Salary  result
0  Ashish   28     100     100
1   Mohan   23     200     200
2  Lokesh   24     300     300

In [189]:
df['result'] = df['Salary']*0.2

In [190]:
df

     name  Age  Salary  result
0  Ashish   28     100    20.0
1   Mohan   23     200    40.0
2  Lokesh   24     300    60.0